Repository: osaurus-ai/osaurus
Catalog: Packages/OsaurusCore/Resources/Localizable.xcstrings
Source language: en
Languages: ko, ru, zh_hans, zh_hant

source: Your data could not be removed and remains at:
ko: 데이터를 제거할 수 없어 다음 위치에 남아 있습니다:
ru: Не удалось удалить ваши данные, они остались по пути:
zh_hans: 无法移除你的数据，数据仍保留在：
zh_hant: 無法移除您的資料，資料仍保留於：

source: Your data is encrypted at rest. No action needed.
ko: 데이터는 유휴 상태에서 암호화됩니다. 추가 조치가 필요하지 않습니다.
ru: Ваши данные зашифрованы при хранении. Никаких действий не требуется.
zh_hans: 你的数据已静态加密。无需任何操作。
zh_hant: 您的數據已靜態加密。無需任何操作。

source: Your data stays yours
ko: 사용자의 데이터는 온전히 사용자의 것입니다
ru: Ваши данные остаются вашими
zh_hans: 你的数据始终归你所有
zh_hant: 你的數據始終歸你所有

source: Your databases are encrypted with a 256-bit key in your macOS Keychain.
ko: 데이터베이스는 macOS 키체인의 256비트 키로 암호화됩니다.
ru: Ваши базы данных зашифрованы 256-битным ключом в вашей Связке ключей macOS.
zh_hans: 你的数据库在 macOS 钥匙串中使用 256 位密钥进行加密。
zh_hant: 您的數據庫在 macOS 鑰匙串中使用 256 位密鑰進行加密。

source: Your databases are not encrypted by Osaurus. macOS FileVault protects them at rest.
ko: 데이터베이스는 Osaurus에 의해 암호화되지 않습니다. macOS FileVault가 유휴 상태에서 데이터를 보호합니다.
ru: Ваши базы данных не зашифрованы Osaurus. macOS FileVault защищает их при хранении.
zh_hans: 你的数据库未由 Osaurus 加密。macOS FileVault 会在静态存储时保护它们。
zh_hant: 您的數據庫未被Osaurus加密。macOS FileVault在靜止狀態下保護它們。

source: Your free $2.50 credit lets you start immediately. Osaurus switches to your private model automatically when it's ready.
ko: 무료 $2.50 크레딧으로 바로 시작할 수 있습니다. 비공개 모델이 준비되면 Osaurus가 자동으로 전환합니다.
ru: Бесплатный кредит $2,50 позволит начать сразу. Когда приватная модель будет готова, Osaurus автоматически переключится на неё.
zh_hans: 免费 $2.50 额度让你立即开始。私有模型准备好后，Osaurus 会自动切换。
zh_hant: 免費 $2.50 額度讓你立即開始。私人模型準備好後，Osaurus 會自動切換。

source: Your identity is active
ko: 사용자의 신원이 활성화되었습니다
ru: Ваша идентификация активна
zh_hans: 你的身份已激活
zh_hant: 你的身份已啟動

source: Your key stays on your Mac, locked in the Keychain.
ko: 키는 사용자의 Mac에 유지되며 키체인에 안전하게 잠겨 있습니다.
ru: Ваш ключ остается на вашем Mac, заблокированный в Связке ключей.
zh_hans: 你的密钥保留在你的 Mac 上，锁定在钥匙串中。
zh_hant: 你的密鑰保留在你的 Mac 上，鎖定在鑰匙串中。

source: Your name (optional)
ko: 이름 (선택 사항)
ru: Ваше имя (необязательно)
zh_hans: 你的名字（可选）
zh_hant: 你的名字（可選）

source: Your Note
ko: 내 노트
ru: Ваше примечание
zh_hans: 你的备注
zh_hant: 你的備註

source: Your Overrides
ko: 사용자 재정의
ru: Ваши переопределения
zh_hans: 你的覆盖项
zh_hant: 你的覆蓋項

source: Your own key
ko: 사용자 소유 키
ru: Ваш собственный ключ
zh_hans: 你的密钥
zh_hant: 您的密鑰

source: Your private model is paused
ko: 비공개 모델 다운로드가 일시 정지되었습니다
ru: Загрузка вашей приватной модели приостановлена
zh_hans: 你的私有模型已暂停
zh_hant: 你的私人模型下載已暫停

source: Your private model needs attention
ko: 비공개 모델을 확인해 주세요
ru: Требуется внимание к вашей приватной модели
zh_hans: 你的私有模型需要处理
zh_hant: 你的私人模型需要處理

source: YOUR RECOVERY CODE
ko: 복구 코드
ru: ВАШ КОД ВОССТАНОВЛЕНИЯ
zh_hans: 你的恢复代码
zh_hant: 你的恢復代碼

source: Your recovery phrase
ko: 복구 구문
ru: Ваша фраза восстановления
zh_hans: 你的恢复助记词
zh_hant: 你的恢復助記詞

source: Your referral is linked. The reward is applied after the first paid top-up.
ko: 추천이 연결되었습니다. 첫 유료 충전 후 보상이 적용됩니다.
ru: Ваша реферальная связь установлена. Награда будет начислена после первого платного пополнения.
zh_hans: 你的推荐关系已建立。首次付费充值后将发放奖励。
zh_hant: 你的推薦關係已建立。首次付費儲值後將發放獎勵。

source: Your secret signature
ko: 비밀 서명
ru: Ваша секретная подпись
zh_hans: 你的秘密签名
zh_hant: 你的祕密簽名

source: Your server is exposed to the local network while Bonjour is enabled.
ko: Bonjour가 활성화되어 있는 동안 서버가 로컬 네트워크에 노출됩니다.
ru: Ваш сервер доступен в локальной сети, пока Bonjour включен.
zh_hans: Bonjour 启用期间，你的服务端会暴露在本地网络中。
zh_hant: Bonjour 啓用期間，你的服務器會暴露在本地網絡中。

source: Your signature (preview)
ko: 서명 (미리보기)
ru: Ваша подпись (предварительный просмотр)
zh_hans: 你的签名（预览）
zh_hant: 你的簽名（預覽）

source: Your wallet for Osaurus-routed services - add credits and track every request and top-up.
ko: Osaurus를 통해 라우팅되는 서비스를 위한 지갑입니다. 크레딧을 추가하고 모든 요청과 충전 내역을 확인하세요.
ru: Ваш кошелёк для сервисов, работающих через Osaurus: пополняйте баланс и отслеживайте каждый запрос и пополнение.
zh_hans: 你的 Osaurus 路由服务钱包 — 添加积分，并跟踪每笔请求与充值。
zh_hant: 用於Osaurus路由服務的錢包 - 添加積分並跟蹤每個請求和充值。

source: Zip Bundle
ko: Zip 번들
ru: ZIP-архив
zh_hans: Zip 压缩包
zh_hant: Zip 捆綁包

source: Off disables the model's native MTP head. Auto uses it only when the model ships a verified head; Force-On requires it. A selected DFlash 2 drafter drafts regardless of Mode — remove it below to stop.
ko: 끄기는 모델의 기본 MTP 헤드를 비활성화합니다. 자동은 모델이 검증된 헤드를 제공할 때만 사용하며, 강제 켬은 해당 헤드가 필요합니다. 선택된 DFlash 2 드래프터는 모드와 관계없이 초안을 생성합니다 — 중지하려면 아래에서 제거하세요.
ru: Выкл. отключает родную голову MTP модели. Auto использует её только тогда, когда модель поставляется с проверенной головой; Force-On требует её. Выбранный драфтер DFlash 2 работает независимо от режима — удалите его ниже, чтобы остановить.
zh_hans: Off 会禁用模型的原生 MTP 头。Auto 仅在模型自带经验证的头时使用；Force-On 要求该头存在。已选择的 DFlash 2 草稿器无论模式如何都会起草——在下方移除即可停止。
zh_hant: Off 會禁用模型的原生 MTP 頭。Auto 僅在模型自帶經驗證的頭時使用；Force-On 要求該頭存在。已選擇的 DFlash 2 草稿器無論模式如何都會起草——在下方移除即可停止。

source: Speak to Model
ko: 모델에게 말하기
ru: Говорить с моделью
zh_hans: 对模型说话
zh_hant: 對模型說話

source: Choose Audio…
ko: 오디오 선택…
ru: Выбрать аудио…
zh_hans: 选择音频…
zh_hant: 選擇音訊…

source: Change Audio…
ko: 오디오 변경…
ru: Изменить аудио…
zh_hans: 更换音频…
zh_hant: 更換音訊…

source: Loading %@…
ko: %@ 로드 중…
ru: Загрузка %@…
zh_hans: 正在加载 %@…
zh_hant: 正在載入 %@…

source: %@ is listening…
ko: %@ 듣는 중…
ru: %@ слушает…
zh_hans: %@ 正在聆听…
zh_hant: %@ 正在聆聽…

source: /command-name
ru: /имя-команды
zh_hans: /命令名称
zh_hant: /命令名稱

source: /models probe
ru: Проверка /models
zh_hans: /models 探测
zh_hant: /models 探測

source: /models required
ru: /требуются модели
zh_hans: /models 必需
zh_hant: /models 必需

# /plugins/%@%@
source: /plugins/%1$@%2$@
ru: /плагины/%1$@%2$@

source: /review
ru: /обзор

source: %.1f tok/s
ru: %.1f ток/с
zh_hans: %.1f Token/秒
zh_hant: %.1f 詞元/秒

source: %@ isn't an MLX model, so it can't be used in Osaurus. The local engine runs MLX-format models only.
ru: %@ не является моделью MLX, поэтому ее нельзя использовать в Osaurus. Локальный движок поддерживает только модели формата MLX.
zh_hans: %@ 不是 MLX 模型，因此无法在 Osaurus 中使用。本地引擎仅支持运行 MLX 格式的模型。
zh_hant: %@ 不是 MLX 模型，因此無法在 Osaurus 中使用。本地引擎僅支持運行 MLX 格式的模型。

source: %@ of %@
ru: %@ из %@

source: %@ router balance. Click to add credits.
ru: Баланс маршрутизатора %@. Нажмите, чтобы пополнить.
zh_hans: %@ 路由器余额。点击添加积分。
zh_hant: %@ 路由器餘額。點擊添加積分。

# %lld pending / %lld flagged
source: %1$lld pending / %2$lld flagged
ru: %1$lld в ожидании / %2$lld помечено
zh_hans: %1$lld 待处理 / %2$lld 已标记
zh_hant: %1$lld 待處理 / %2$lld 已標記

# %lld settings match "%@"
source: %1$lld settings match "%2$@"
ru: Настройки %1$lld соответствуют «%2$@»
zh_hans: %lld 个设置匹配“%@”
zh_hant: %lld 個設置匹配"%@"

source: %lld transaction(s)
ru: %lld транзакция(и)
zh_hans: %lld 笔交易
zh_hant: %lld 筆交易

source: %lldms
ru: %lldмс
zh_hans: %lld 毫秒
zh_hant: %lld 毫秒

source: ⚠ thinking didn't close — answer may be in reasoning above
ru: ⚠ мышление не закрылось — ответ может быть в рассуждениях выше
zh_hans: ⚠ 思考过程未关闭 — 答案可能已在上述推理中
zh_hant: ⚠ 思考過程未關閉 — 答案可能已在上述推理中

source: A connected peer is running “%@”.
ru: Подключенный узел работает под управлением «%@».
zh_hans: 已连接的对等节点正在运行“%@”。
zh_hant: 已連接的對等節點正在運行「%@」。

source: Add a negative prompt
ru: Добавьте отрицательную промпт
zh_hans: 添加负面提示词
zh_hant: 添加負面提示詞

source: Add agent
ru: Добавить агента
zh_hans: 添加智能体
zh_hant: 添加智能體

source: Add model
ru: Добавить модель
zh_hans: 添加模型
zh_hant: 添加模型

source: agent delegation is disabled in Settings
ru: делегирование агента отключено в настройках
zh_hans: 代理委托已在设置中禁用
zh_hant: 代理委託已在設置中禁用

source: Agent in use
ru: Агент используется
zh_hans: 智能体正在使用中
zh_hant: 代理正在使用中

source: Agents & Automation
ru: Агенты и автоматизация
zh_hans: 智能体与自动化
zh_hant: 智能體與自動化

source: AI
ru: ИИ

source: Allow Summary
ru: Разрешить сводку
zh_hans: 允许摘要
zh_hant: 允許摘要

source: Allowed
ru: Разрешено
zh_hans: 已允许
zh_hant: 已允許

source: Allowed agents
ru: Разрешенные агенты
zh_hans: 允许的智能体
zh_hant: 允許的智能體

source: Allowed models
ru: Разрешенные модели
zh_hans: 允许的模型
zh_hant: 允許的模型

source: Anthropic
ru: антропный
zh_hans: Anthropic（提供商）
zh_hant: Anthropic（提供商）

source: AppleScript automation
ru: Автоматизация AppleScript
zh_hans: AppleScript 自动化
zh_hant: AppleScript 自動化

source: AppleScript model
ru: Модель AppleScript
zh_hans: AppleScript 模型
zh_hant: AppleScript 模型

source: Ask Before Expanded Sharing
ru: Спросите перед расширенным обменом
zh_hans: 扩展共享前询问
zh_hant: 擴展共享前詢問

source: Attach one source image to edit with this model.
ru: Прикрепите одно исходное изображение для обезличивания с помощью этой модели.
zh_hans: 附加一张源图片以使用此模型进行编辑。
zh_hant: 附加一張源圖片以使用此模型進行編輯。

source: Auto-run with warning
ru: Автозапуск с предупреждением
zh_hans: 带警告自动运行
zh_hant: 帶警告自動運行

source: Balanced. Good detail at a moderate speed.
ru: Сбалансированный. Хорошая детализация на средней скорости.
zh_hans: 均衡。细节适中，速度适中。
zh_hant: 均衡。細節適中，速度適中。

source: Before a spawned image or text job, verify the helper model fits in memory once the chat model is freed. If it won't fit, refuse the job instead of unloading the chat model and failing to load the helper.
ru: Перед запуском вспомогательной задачи с изображением или текстом проверяется, поместится ли модель помощника в память после выгрузки модели чата. Если памяти не хватает, задача отклоняется вместо выгрузки модели чата и последующей ошибки загрузки помощника.
zh_hans: 在生成图像或文本任务之前，先验证释放聊天模型后辅助模型能否装入内存。如果无法装入，则拒绝任务，而不是卸载聊天模型后加载辅助模型失败。
zh_hant: 在生成圖像或文本任務之前，先驗證釋放聊天模型後輔助模型能否裝入內存。如果無法裝入，則拒絕任務，而不是卸載聊天模型後加載輔助模型失敗。

source: Bottom Center
ru: Снизу по центру
zh_hans: 底部居中
zh_hant: 底部居中

source: Bottom Left
ru: Снизу слева
zh_hans: 左下
zh_hant: 左下

source: Bottom Right
ru: Снизу справа
zh_hans: 右下
zh_hant: 右下

source: Browse models
ru: Обзор моделей
zh_hans: 浏览模型
zh_hant: 瀏覽模型

source: Can't verify %@
ru: Не могу проверить %@
zh_hans: 无法验证 %@
zh_hant: 無法驗證 %@

source: Choose automatically
ru: Выбирать автоматически
zh_hans: 自动选择
zh_hant: 自動選擇

source: Choose the on-device model that powers AI detection. Pattern rules in the Rules tab work without any model.
ru: Выберите модель устройства, обеспечивающую обнаружение ИИ. Правила шаблонов на вкладке «Правила» работают без какой-либо модели.
zh_hans: 选择用于驱动 AI 检测的端侧模型。“规则”标签页中的模式规则无需任何模型即可运行。
zh_hant: 選擇用於驅動 AI 檢測的端側模型。"規則"選項卡中的模式規則無需任何模型即可運行。

source: Classifier-free guidance
ru: Руководство без классификаторов
zh_hans: 无分类器引导
zh_hant: 無分類器引導

source: Compact Result Only
ru: Только компактный результат
zh_hans: 仅紧凑结果
zh_hant: 僅緊湊結果

source: Confirm each script
ru: Подтверждать каждый сценарий
zh_hans: 确认每个脚本
zh_hant: 確認每個腳本

source: Copy diagnostics and include this redacted request/response evidence with the report.
ru: Скопируйте диагностику и приложите к отчёту эти обезличенные данные запроса и ответа.
zh_hans: 复制诊断信息，并将这份已脱敏的请求/响应证据一并附在报告中。
zh_hant: 複製診斷信息，並將這份已編輯的請求/響應證據一併附在報告中。

source: Cursor
ru: Курсор
zh_hans: 光标
zh_hant: 光標

source: DeepSeek
ru: ДипСик

source: Default models, permission, and load policy for the main chat are in the Images tab.
ru: Модели по умолчанию, разрешения и политика загрузки для основного чата находятся на вкладке «Изображения».
zh_hans: 默认模型、权限和主聊天加载策略位于“图片”标签页。
zh_hant: 默認模型、權限和主聊天加載策略位於“圖片”標籤頁。

source: Default steps
ru: Шаги по умолчанию
zh_hans: 默认步骤
zh_hant: 默認步驟

source: Delete Skill
ru: Удалить навык
zh_hans: 删除技能
zh_hant: 刪除技能

source: Denoising steps
ru: Шаги шумоподавления
zh_hans: 去噪步数
zh_hant: 去噪步驟

source: Describe the image...
ru: Опишите изображение…
zh_hans: 描述图片…
zh_hant: 描述圖片...

source: Detection Models
ru: Модели обнаружения
zh_hans: 检测模型
zh_hant: 檢測模型

source: e.g. blurry, low quality, extra fingers
ru: например размытое, низкое качество, лишние пальцы
zh_hans: 例如：模糊、低质量、多余手指
zh_hant: 例如：模糊、低質量、多餘手指

source: E2E
ru: Е2Е
zh_hans: 端到端
zh_hant: 端到端

source: Each generated AppleScript is shown for your approval before it runs.
ru: Каждый сгенерированный AppleScript показывается вам на подтверждение перед запуском.
zh_hans: 每个生成的 AppleScript 在运行前都会显示以供你批准。
zh_hant: 每個生成的 AppleScript 在運行前都會顯示以供你批准。

source: Each helper is off by default. Turn one on to set it up.
ru: По умолчанию каждый помощник отключен. Включите один из них, чтобы настроить его.
zh_hans: 每个助手默认都是关闭的。开启其中一个以进行设置。
zh_hant: 每個助手默認都是關閉的。開啓其中一個以進行設置。

source: Edit Image
ru: Редактировать изображение
zh_hans: 编辑图片
zh_hant: 編輯圖片

source: Edit model
ru: Редактировать модель
zh_hans: 图像编辑模型
zh_hant: 編輯模型

source: Edited the image
ru: Отредактировал изображение
zh_hans: 已编辑图片
zh_hant: 已編輯圖片

source: Editing the image
ru: Редактирование изображения
zh_hans: 正在编辑图片
zh_hant: 正在編輯圖片

source: Enable Transcription Mode
ru: Включить режим транскрипции
zh_hans: 启用转写模式
zh_hant: 啓用轉寫模式

source: Enable VAD Mode
ru: Включить режим VAD
zh_hans: 启用语音活动检测模式
zh_hant: 啓用語音活動檢測模式

source: Enable Voice Input
ru: Включить голосовой ввод
zh_hans: 启用语音输入
zh_hant: 啓用語音輸入

source: Enter a prompt to generate an image.
ru: Введите промпт для создания изображения.
zh_hans: 输入提示词以生成图片。
zh_hant: 輸入提示詞以生成圖片。

source: Exported router support bundle to %@.
ru: Пакет поддержки Router экспортирован в %@.
zh_hans: 已将路由器支持捆绑包导出到 %@。
zh_hant: 將路由器支持捆綁包導出到%@。

source: Fast drafts. Lowest detail, quickest to render.
ru: Быстрые черновики. Самая низкая детализация, самая быстрая визуализация.
zh_hans: 快速草稿。细节最低，渲染最快。
zh_hant: 快速草稿。細節最低，渲染最快。

source: Freeze a text-only snapshot of your screen at the start of each chat and share it as background context. No screenshots; scrubbed by the Privacy Filter before cloud sends.
ru: Создавайте текстовый снимок экрана в начале каждого чата и передавайте его как фоновый контекст. Без скриншотов; перед отправкой в облако данные очищаются фильтром конфиденциальности.
zh_hans: 在每次对话开始时，以纯文本形式冻结当前屏幕快照，并将其作为背景上下文分享。不涉及任何截图；在发送至云端之前，内容已由 Privacy Filter 完成脱敏处理。
zh_hant: 在每次對話開始時，以純文本形式凍結當前屏幕快照，並將其作爲背景上下文分享。不涉及任何截圖；在發送至雲端之前，內容已由 Privacy Filter 完成脫敏處理。

source: Generate and edit images with on-device models
ru: Создавайте и редактируйте изображения с помощью моделей на устройстве
zh_hans: 使用设备端模型生成和编辑图像
zh_hant: 使用設備端模型生成和編輯圖像

source: Generate and edit images with on-device models • %lld on device
ru: Создавайте и редактируйте изображения с помощью моделей на устройстве • %lld на устройстве
zh_hans: 使用设备端模型生成和编辑图像 • 设备端 %lld 个
zh_hant: 使用設備上的模型生成和編輯圖像 • %lld 在設備上

source: Generate Image
ru: Создать изображение
zh_hans: 生成图片
zh_hant: 生成圖片

source: Generated an image
ru: Сгенерировано изображение
zh_hans: 已生成图片
zh_hant: 已生成圖片

source: Generating an image
ru: Создание изображения
zh_hans: 正在生成图片
zh_hant: 正在生成圖片

source: Generating image…
ru: Создание изображения…
zh_hans: 正在生成图片…
zh_hant: 正在生成圖片…

source: Generation model
ru: Модель поколения
zh_hans: 生成模型
zh_hant: 生成模型

source: Give the agent the spawn / local_delegate / image_generate / image_edit tools — it can offload bounded tasks to a subagent persona or a local model, and generate or edit images. Default models, RAM-safety, and permissions are configured in Settings → Spawn.
ru: Дайте агенту инструменты spawn / local_delegate / image_generate / image_edit: он сможет передавать ограниченные задачи субагенту или локальной модели, а также генерировать и редактировать изображения. Модели по умолчанию, проверка памяти и разрешения настраиваются в «Настройки» → «Субагенты».
zh_hans: 赋予代理 spawn / local_delegate / image_generate / image_edit 工具——它可以将有界任务卸载给子代理角色或本地模型，并生成或编辑图片。默认模型、内存安全和权限在“设置 → 生成”中配置。
zh_hant: 賦予代理 spawn / local_delegate / image_generate / image_edit 工具——它可以將有界任務卸載給子代理角色或本地模型，並生成或編輯圖片。默認模型、內存安全和權限在“設置 → 生成”中配置。

source: Google Gemini
ru: Гугл Близнецы
zh_hans: Google Gemini（提供商）
zh_hant: Google Gemini（提供商）

source: Grok
ru: Грок

source: Highest coverage. Adds names, addresses, dates, and free-form secrets beyond pattern rules.
ru: Самый высокий охват. Добавляет имена, адреса, даты и секреты в свободной форме помимо правил шаблона.
zh_hans: 最高覆盖率。 在模式规则的基础上，额外覆盖姓名、地址、日期以及自由格式的敏感信息。
zh_hant: 最高覆蓋率。 在模式規則的基礎上，額外覆蓋姓名、地址、日期以及自由格式的敏感信息。

source: How image jobs ask for permission and manage GPU memory between runs.
ru: Как задания изображения запрашивают разрешение и управляют памятью GPU между запусками.
zh_hans: 图像任务如何请求权限以及在运行间管理 GPU 显存。
zh_hant: 圖像任務如何請求權限以及在運行間管理 GPU 顯存。

source: How strongly the prompt changes the source image
ru: Насколько сильно промпт меняет исходное изображение
zh_hans: 提示词对源图片的改变强度
zh_hant: 提示詞對源圖片的改變強度

source: Image Copied to Clipboard
ru: Изображение скопировано в буфер обмена
zh_hans: 图片已复制到剪贴板
zh_hant: 圖片已複製到剪貼板

source: Image Generation
ru: Генерация изображений
zh_hans: 图片生成
zh_hant: 圖片生成

source: Image generation cancelled.
ru: Создание изображения отменено.
zh_hans: 图片生成已取消。
zh_hant: 圖片生成已取消。

source: Image generation failed:
ru: Не удалось создать изображение:
zh_hans: 图片生成失败：
zh_hant: 圖片生成失敗：

source: Image generation failed: no model selected
ru: Не удалось создать изображение: модель не выбрана
zh_hans: 图片生成失败：未选择模型
zh_hant: 圖片生成失敗：未選擇模型

source: Image generation failed: selected model is not an image model.
ru: Не удалось создать изображение: выбранная модель не является моделью изображения.
zh_hans: 图片生成失败：所选模型不是图片模型。
zh_hant: 圖片生成失敗：所選模型不是圖片模型。

source: Image generation produced no image.
ru: Генерация изображения не создала изображения.
zh_hans: 图片生成未产生图片。
zh_hant: 圖片生成未產生圖片。

source: Image load policy is a system setting in the Images tab.
ru: Политика загрузки изображений — это системная настройка на вкладке «Изображения».
zh_hans: 图片加载策略是“图片”标签页中的一个系统设置。
zh_hant: 圖片加載策略是「圖片」標籤頁中的一個系統設置。

source: Image models will appear here
ru: Здесь появятся изображения моделей
zh_hans: 图片模型将显示在此处
zh_hant: 圖片模型將顯示在此處

source: Image saved
ru: Изображение сохранёно
zh_hans: 图片已保存
zh_hant: 圖片已保存

source: Image size
ru: Размер изображения
zh_hans: 图片大小
zh_hant: 圖片大小

source: Images
ru: Изображения
zh_hans: 图片
zh_hant: 圖片

source: Import a model from Hugging Face
ru: Импортируйте модель из Hugging Face
zh_hans: 从 Hugging Face 导入模型
zh_hant: 從 Hugging Face 導入模型

source: Inherit parent model
ru: Наследовать родительскую модель
zh_hans: 继承父模型
zh_hant: 繼承父模型

source: Inspect response
ru: Проверить ответ
zh_hans: 检查响应
zh_hant: 檢查響應

source: Keep Warm When Safe
ru: Сохранять в памяти, если безопасно
zh_hans: 安全时保持预热
zh_hant: 安全時保持預熱

source: Last signed checks
ru: Последние проверки подписи
zh_hans: 最近的签名校验
zh_hant: 最近籤署的支票

source: Let the agent automate this Mac by writing and running AppleScript with an on-device model. Each script is shown for your approval or auto-run with a warning, per the mode below.
ru: Позвольте агенту автоматизировать этот Mac: писать и запускать AppleScript с помощью локальной модели. Каждый сценарий показывается для подтверждения или запускается автоматически с предупреждением — в зависимости от режима ниже.
zh_hans: 让智能体通过使用设备端模型编写和运行 AppleScript 来自动化此 Mac。每个脚本都会显示以供你批准，或根据下方模式带警告自动运行。
zh_hant: 讓智能體通過使用設備端模型編寫和運行 AppleScript 來自動化此 Mac。每個腳本都會顯示以供你批准，或根據下方模式帶警告自動運行。

source: Let the agent control macOS apps for you — clicking, typing, and reading the screen. Reads and navigation run automatically; edits and anything consequential pause for your approval.
ru: Позвольте агенту управлять приложениями macOS за вас: щелкать мышью, печатать и читать с экрана. Чтение и навигация выполняются автоматически; правки и все, что связано с ними, приостанавливаются на ваше одобрение.
zh_hans: 允许智能体为你控制 macOS 应用 — 点击、输入与读取屏幕内容。读取与导航操作自动执行；编辑及其它有后果的操作将暂停并等待你批准。
zh_hant: 允許智能體爲您控制 macOS 應用 — 點擊、輸入與讀取屏幕內容。讀取與導航操作自動執行；編輯及其它有後果的操作將暫停並等待您批准。

source: Let the agent generate and edit images with a local model using the `image` tool.
ru: Позвольте агенту генерировать и редактировать изображения с использованием локальной модели с помощью инструмента `image`.
zh_hans: 允许智能体使用本地模型，通过 `image` 工具生成和编辑图像。
zh_hant: 允許智能體使用本地模型，通過 image 工具生成和編輯圖像。

source: Let the main chat spawn image and local-model helper jobs
ru: Позвольте основному чату создавать изображения и вспомогательные задания локальной модели.
zh_hans: 允许主聊天生成图片和本地模型辅助任务
zh_hant: 允許主聊天生成圖片和本地模型輔助任務

source: Let this agent delegate work — control your Mac, hand tasks to other agents, or generate images.
ru: Позвольте этому агенту делегировать работу — управляйте вашим Mac, передавайте задачи другим агентам или создавайте изображения.
zh_hans: 允许此智能体委托工作 — 控制你的 Mac、将任务移交给其他智能体，或生成图像。
zh_hant: 允許此智能體委託工作 — 控制您的 Mac、將任務移交給其他智能體，或生成圖像。

source: Let this agent hand a bounded task to another agent or model you allow below — the subagent runs it and returns just the result.
ru: Позвольте этому агенту передать ограниченную задачу другому агенту или модели, которую вы разрешите ниже — субагент запускает ее и возвращает только результат.
zh_hans: 允许此智能体将指定任务移交给下方授权的另一智能体或模型 — 子智能体执行任务并仅返回结果。
zh_hant: 允許此智能體將指定任務移交給下方授權的另一智能體或模型 — 子智能體執行任務並僅返回結果。

source: Let this agent spawn helper jobs and subagents.
ru: Пусть этот агент создает вспомогательные задания и субагенты.
zh_hans: 允许此代理生成辅助任务和子代理。
zh_hant: 允許此代理生成輔助任務和子代理。

source: Limits
ru: Пределы
zh_hans: 限制
zh_hant: 限制

source: Listing
ru: Листинг
zh_hans: 条目
zh_hant: 列表

source: Loading image model…
ru: Загрузка модели изображения…
zh_hans: 正在加载图片模型…
zh_hant: 正在加載圖片模型…

source: Loading model…
ru: Загрузка модели…
zh_hans: 正在加载模型…
zh_hant: 正在加載模型…

source: Local Handoff & RAM Safety
ru: Локальная передача и проверка памяти
zh_hans: 本地交接与内存安全
zh_hant: 本地交接與內存安全

source: Local handoff and RAM-safety for spawn jobs are system settings in Settings → Subagents.
ru: Локальная передача и проверка памяти для задач делегирования настраиваются в «Настройки» → «Субагенты».
zh_hans: 本地交接与生成任务的内存安全属于系统设置，可在“设置 → 子智能体”中配置。
zh_hant: 本地移交與生成任務的內存安全設置，屬於系統設置，可在「設置 → 子智能體」中配置。

source: Local Orchestrator Handoff
ru: Локальная передача выполнения
zh_hans: 本地协调器交接
zh_hant: 本地協調器交接

source: Local Orchestrator Handoff is off (Settings → Subagents). Spawning a local agent or model whose model differs from the current chat model will be refused — only remote targets and the loaded model run.
ru: Локальная передача выполнения отключена («Настройки» → «Субагенты»). Запуск локального агента или модели, отличающейся от текущей модели чата, будет отклонён: доступны только удалённые цели и уже загруженная модель.
zh_hans: 本地编排移交已关闭（设置 → 子智能体）。尝试生成/启动模型与当前对话模型不同的本地智能体或模型将被拒绝 — 仅允许运行远程目标和已加载的模型。
zh_hant: 本地編排移交已關閉（設置 → 子代理）。嘗試生成/啓動模型與當前對話模型不同的本地代理或模型將被拒絕 — 僅允許運行遠程目標和已加載的模型。

source: Make and check off your Reminders.
ru: Создаёт напоминания и отмечает их выполненными.
zh_hans: 创建和完成你的提醒事项。
zh_hant: 建立和完成您的提醒事項。

source: Manual Panel Keeps Loaded
ru: Ручная панель остается загруженной
zh_hans: 手动面板保持加载
zh_hant: 手動面板保持加載

source: Markdown
ru: Уценка

source: Max seconds
ru: Макс. секунды
zh_hans: 最大秒数
zh_hant: 最大秒數

source: Max tokens
ru: Макс. токенов
zh_hans: 最大 Token 数
zh_hant: 最大詞元數

source: Max turns
ru: Максимум ходов
zh_hans: 最大轮数
zh_hant: 最大輪數

source: MiniMax
ru: МиниМакс

source: Mistral
ru: Мистраль

source: Model id
ru: Идентификатор модели
zh_hans: 模型 ID
zh_hant: 模型 ID

source: Model not supported
ru: Модель не поддерживается
zh_hans: 模型不受支持
zh_hant: 模型不受支持

source: Model totals
ru: Итоги модели
zh_hans: 模型用量合计
zh_hant: 模型總數

source: More
ru: Более
zh_hans: 更多
zh_hant: 更多

source: Negative prompt
ru: Негативный промпт
zh_hans: 负面提示词
zh_hant: 負面提示詞

source: No image models
ru: Нет моделей изображений
zh_hans: 没有图片模型
zh_hant: 沒有圖片模型

source: No image-edit models installed, so editing is unavailable. Download an edit-capable model (e.g. Qwen-Image-Edit) to enable it.
ru: Модели для обезличивания изображений не установлены, поэтому редактирование недоступно. Загрузите модель с возможностью обезличивания (например, Qwen-Image-Edit), чтобы включить ее.
zh_hans: 未安装图像编辑模型，因此编辑功能不可用。请下载支持编辑的模型（例如 Qwen-Image-Edit）以启用该功能。
zh_hant: 未安裝圖像編輯模型，因此編輯功能不可用。請下載支持編輯的模型（例如 Qwen-Image-Edit）以啓用該功能。

source: No matching agents.
ru: Нет подходящих агентов.
zh_hans: 没有匹配的智能体。
zh_hant: 沒有匹配的智能體。
